print('''
Data Type   Is immutable?   Is iterable? Short description
int         Да              Нет          Целые числа, положительные и отрицательные
float       Да              Нет          Числа с дробной частью, положительные и отрицательные
bool        Да              Нет          Булевы значение True и False
complex     Да              Нет          Комплексные числа
tuple       Да              Да           Кортежи, неизменяемый список значений
frozenset   Да              Да           Контейнер содержащий уникальные значение. Неизменяемый
str         Да              Да           Строковая переменная любой длины. 
list        Нет             Да           Список значений любого типа
set         Нет             Да           Контейнер содержащий уникальные значений любого типа. Изменяемый   
dict        Нет             Да           Контейнер содержащий значения в виде пар Ключ:Значение
''')